{
  "word_to_idx": {
    "ai": 1,
    "хранилище": 2,
    "сайт": 3,
    "testing": 4,
    "database": 5,
    "docker": 6,
    "оптимизировать": 7,
    "authentication": 8,
    "sql": 9,
    "аналитик": 10,
    "qa": 11,
    "backend": 12,
    "веб": 13,
    "создать": 14,
    "android": 15,
    "mysql": 16,
    "flutter": 17,
    "chat bot": 18,
    "тестиров": 19,
    "дашборд": 20,
    "ios": 21,
    "nlp": 22,
    "frontend": 23,
    "ci/cd": 24,
    "machine learning": 25,
    "dashboard": 26,
    "security": 27,
    "шифрование": 28,
    "настроить": 29,
    "протестировать": 30,
    "postgresql": 31,
    "искусственн": 32,
    "mongodb": 33,
    "автотест": 34,
    "нейросет": 35,
    "react native": 36,
    "деплой": 37,
    "web": 38,
    "kubernetes": 39,
    "analytics": 40,
    "интернет-магазин": 41,
    "мобильн": 42,
    "devops": 43,
    "отчет": 44,
    "mobile": 45,
    "authorization": 46,
    "безопасност": 47,
    "визуализац": 48,
    "интегрировать": 49,
    "разработать": 50,
    "реализовать": 51,
    "база данн": 52,
    "unit test": 53,
    "мониторинг": 54
  },
  "idx_to_word": {
    "1": "ai",
    "2": "хранилище",
    "3": "сайт",
    "4": "testing",
    "5": "database",
    "6": "docker",
    "7": "оптимизировать",
    "8": "authentication",
    "9": "sql",
    "10": "аналитик",
    "11": "qa",
    "12": "backend",
    "13": "веб",
    "14": "создать",
    "15": "android",
    "16": "mysql",
    "17": "flutter",
    "18": "chat bot",
    "19": "тестиров",
    "20": "дашборд",
    "21": "ios",
    "22": "nlp",
    "23": "frontend",
    "24": "ci/cd",
    "25": "machine learning",
    "26": "dashboard",
    "27": "security",
    "28": "шифрование",
    "29": "настроить",
    "30": "протестировать",
    "31": "postgresql",
    "32": "искусственн",
    "33": "mongodb",
    "34": "автотест",
    "35": "нейросет",
    "36": "react native",
    "37": "деплой",
    "38": "web",
    "39": "kubernetes",
    "40": "analytics",
    "41": "интернет-магазин",
    "42": "мобильн",
    "43": "devops",
    "44": "отчет",
    "45": "mobile",
    "46": "authorization",
    "47": "безопасност",
    "48": "визуализац",
    "49": "интегрировать",
    "50": "разработать",
    "51": "реализовать",
    "52": "база данн",
    "53": "unit test",
    "54": "мониторинг"
  }
}